osdomotics/stk500boot_atmega256rfr2/stk500boot.c
	unsigned long	boot_timeout;
	unsigned long	boot_timer;
	unsigned int	boot_state;
#ifdef ENABLE_MONITOR
	unsigned int	exPointCntr		=	0;
	unsigned int	rcvdCharCntr		=	0;
#endif

	//*	some chips dont set the stack properly
	asm volatile ( ".set __stack, %0" :: "i" (RAMEND) );
	asm volatile ( "ldi	16, %0" :: "i" (RAMEND >> 8) );
	asm volatile ( "out %0,16" :: "i" (AVR_STACK_POINTER_HI_ADDR) );
	asm volatile ( "ldi	16, %0" :: "i" (RAMEND & 0x0ff) );
	asm volatile ( "out %0,16" :: "i" (AVR_STACK_POINTER_LO_ADDR) );

#ifdef _FIX_ISSUE_181_
	//************************************************************************
	//*	Dec 29,	2011	<MLS> Issue #181, added watch dog timmer support
	//*	handle the watch dog timer
	uint8_t	mcuStatusReg;
	mcuStatusReg	=	MCUSR;

	__asm__ __volatile__ ("cli");
	__asm__ __volatile__ ("wdr");
	MCUSR	=	0;
	WDTCSR	|=	_BV(WDCE) | _BV(WDE);
	WDTCSR	=	0;
	__asm__ __volatile__ ("sei");
	// check if WDT generated the reset, if so, go straight to app
	if (mcuStatusReg & _BV(WDRF))
	{
		start_user ();
	}
	//************************************************************************
#endif


	boot_timer	=	0;
	boot_state	=	0;

#ifdef BLINK_LED_WHILE_WAITING
	boot_timeout	=	 90000;		//*	should be about 4 seconds
#else
	boot_timeout	=	3500000; // 7 seconds , approx 2us per step when optimize "s"
#endif

#ifdef BOOT_PIN_EN
	/* if bOOT pin is low the enter the bootloader */
	BOOT_DDR	&= ~(1<<BOOT_PIN); // Input
	BOOT_PORT	&= ~(1<<BOOT_PIN); // no Pull-Up
	STATUSLED_DDR	|=  (1<<STATUSLED_PIN);
	STATUSLED_PORT	|=  (1<<STATUSLED_PIN);

	if (BOOT_PIN_REG &(1<<BOOT_PIN)){
		STATUSLED_PORT &= ~(1<<STATUSLED_PIN);	// turn LED on
	}

#endif
	/*
	 * Branch to bootloader or application code ?
	 */

#ifndef REMOVE_BOOTLOADER_LED
	/* PROG_PIN pulled low, indicate with LED that bootloader is active */
	PROGLED_DDR	|=	(1<<PROGLED_PIN);
//	PROGLED_PORT	&=	~(1<<PROGLED_PIN);	// active low LED ON
	PROGLED_PORT	|=	(1<<PROGLED_PIN);	// active high LED ON

#ifdef _DEBUG_WITH_LEDS_
	for (ii=0; ii<3; ii++)
	{
		PROGLED_PORT	&=	~(1<<PROGLED_PIN);	// turn LED off
		delay_ms(100);
		PROGLED_PORT	|=	(1<<PROGLED_PIN);	// turn LED on
		delay_ms(100);
	}
#endif

#endif
	/*
	 * Init UART
	 * set baudrate and enable USART receiver and transmiter without interrupts
	 */
#if UART_BAUDRATE_DOUBLE_SPEED
	UART_STATUS_REG		|=	(1 <<UART_DOUBLE_SPEED);
#endif
	UART_BAUD_RATE_LOW	=	UART_BAUD_SELECT(BAUDRATE,F_CPU);
	UART_CONTROL_REG	=	(1 << UART_ENABLE_RECEIVER) | (1 << UART_ENABLE_TRANSMITTER);

#if defined(_BOARD_MESHTHING_2564RFR2_) || defined(_BOARD_GUHRF_) || defined( _BOARD_RASPBEE_ ) || defined( OSD_TARGET )
/*
	UCSR1A &= ~(1 << U2X1);
	UART_CONTROL_REG  |=	(1 << UART_ENABLE_RECEIVER) | (1 << UART_ENABLE_TRANSMITTER);
	UBRR1H = (UART_BAUD_SELECT(BAUDRATE,F_CPU)>>8);
	UART_BAUD_RATE_LOW	=	UART_BAUD_SELECT(BAUDRATE,F_CPU);

	UCSR1C |= (0 << USBS1) | (1 << UCSZ10) | (1 << UCSZ11);
*/

	#  define UCSRA UCSR0A
	#  define UDRE  UDRE0
	#  define UCSRB UCSR0B
	#  define RXEN  RXEN0
	#  define TXEN  TXEN0
	#  define UCSRC UCSR0C

	#  define UBRR UBRR0L
	#  define UDR UDR0

	#define BAUDRATE 57600
//	#define BAUD_PRESCALE (F_CPU / 16 / BAUDRATE -1)

//trying double speed as it has less error at 115200...
	#define BAUD_PRESCALE (F_CPU / 8 / BAUDRATE -1)
	UCSRA |= 1 << U2X0;

	// Clear double speed operation
	//UCSRA &= ~(1 << U2X1);

	// Enable TX and RX circuitry
  	UCSRB |= (1 << RXEN) | (1 << TXEN);

	// 8-bit data, 1 stop bit
  	UCSRC |= (0 << USBS1) | (1 << UCSZ10) | (1 << UCSZ11);

	// Initialize baud rate
  	UBRR0H = (BAUD_PRESCALE >> 8);
  	UBRR0L =  BAUD_PRESCALE;

#endif


	asm volatile ("nop");			// wait until port has changed

#ifdef _DEBUG_SERIAL_
//	delay_ms(500);

	sendchar('s');
	sendchar('t');
	sendchar('k');
//	sendchar('5');
//	sendchar('0');
//	sendchar('0');
	sendchar('v');
	sendchar('2');
	sendchar(0x0d);
	sendchar(0x0a);

	delay_ms(100);
#endif

	while (boot_state==0)
	{
		while ((!(Serial_Available())) && (boot_state == 0))		// wait for data
		{
			_delay_ms(0.001);
			boot_timer++;
			if (boot_timer > boot_timeout)
			{
				boot_state	=	1; // (after ++ -> boot_state=2 bootloader timeout, jump to main 0x00000 )
			}
		#ifdef BLINK_LED_WHILE_WAITING
			if ((boot_timer % _BLINK_LOOP_COUNT_) == 0)
			{

#ifdef _DEBUG_SERIAL_
				sendchar('b');
#endif
			//*	toggle the LED
				PROGLED_PORT	^=	(1<<PROGLED_PIN);	// turn LED ON
			}
		#endif
		}
		boot_state++; // ( if boot_state=1 bootloader received byte from UART, enter bootloader mode)
	}

#ifdef BOOT_PIN_EN
	if ((boot_state==1) && (BOOT_PIN_REG &(1<<BOOT_PIN)))
#else
	if (boot_state==1)
#endif
	{
		//*	main loop
//		sendchar('m');
		while (!isLeave)
		{
			/*
			 * Collect received bytes to a complete message
			 */
			msgParseState	=	ST_START;
			while ( msgParseState != ST_PROCESS )
			{
//				sendchar('w');
				if (boot_state==1)
				{
					boot_state	=	0;
					c			=	UART_DATA_REG;
				}
				else
				{
				//	c	=	recchar();
					c	=	recchar_timeout();

				}

			#ifdef ENABLE_MONITOR
				rcvdCharCntr++;

				if ((c == '!')  && (rcvdCharCntr < 10))
				{
					exPointCntr++;
					if (exPointCntr == 3)
					{
						RunMonitor();
						exPointCntr		=	0;	//	reset back to zero so we dont get in an endless loop
						isLeave			=	1;
						msgParseState	=	99;	//*	we dont want it do anything
						break;
					}
				}
				else
				{
					exPointCntr	=	0;
				}
			#endif

				switch (msgParseState)
				{
					case ST_START:
						if ( c == MESSAGE_START )
						{
//								sendchar('0');
							msgParseState	=	ST_GET_SEQ_NUM;
							checksum		=	MESSAGE_START^0;
						}
						break;

					case ST_GET_SEQ_NUM:
//								sendchar('1');
					#ifdef _FIX_ISSUE_505_
						seqNum			=	c;
						msgParseState	=	ST_MSG_SIZE_1;
						checksum		^=	c;
					#else
						if ( (c == 1) || (c == seqNum) )
						{
							seqNum			=	c;
							msgParseState	=	ST_MSG_SIZE_1;
							checksum		^=	c;
						}
						else
						{
							msgParseState	=	ST_START;
						}
					#endif
						break;

					case ST_MSG_SIZE_1:
						msgLength		=	c<<8;
						msgParseState	=	ST_MSG_SIZE_2;
						checksum		^=	c;
						break;

					case ST_MSG_SIZE_2:
						msgLength		|=	c;
						msgParseState	=	ST_GET_TOKEN;
						checksum		^=	c;
						break;

					case ST_GET_TOKEN:
						if ( c == TOKEN )
						{
							msgParseState	=	ST_GET_DATA;
							checksum		^=	c;
							ii				=	0;
						}
						else
						{
							msgParseState	=	ST_START;
						}
						break;

