osdomotics/stk500boot_atmega256rfr2/stk500boot.c
				case CMD_READ_FLASH_ISP:
				case CMD_READ_EEPROM_ISP:
					{
						unsigned int	size	=	((msgBuffer[1])<<8) | msgBuffer[2];
						unsigned char	*p		=	msgBuffer+1;
						msgLength				=	size+3;

						*p++	=	STATUS_CMD_OK;
						if (msgBuffer[0] == CMD_READ_FLASH_ISP )
						{
							unsigned int data;

							// Read FLASH
							do {
						//#if defined(RAMPZ)
						#if (FLASHEND > 0x10000)
								data	=	pgm_read_word_far(address);
						#else
								data	=	pgm_read_word_near(address);
						#endif
								*p++	=	(unsigned char)data;		//LSB
								*p++	=	(unsigned char)(data >> 8);	//MSB
								address	+=	2;							// Select next word in memory
								size	-=	2;
							}while (size);
						}
						else
						{
							/* Read EEPROM */
							do {
								EEARL	=	address;			// Setup EEPROM address
								EEARH	=	((address >> 8));
								address++;					// Select next EEPROM byte
								EECR	|=	(1<<EERE);			// Read EEPROM
								*p++	=	EEDR;				// Send EEPROM data
								size--;
							} while (size);
						}
						*p++	=	STATUS_CMD_OK;
					}
					break;

				default:
					msgLength		=	2;
					msgBuffer[1]	=	STATUS_CMD_FAILED;
					break;
			}

			/*
			 * Now send answer message back
			 */
			sendchar(MESSAGE_START);
			checksum	=	MESSAGE_START^0;

			sendchar(seqNum);
			checksum	^=	seqNum;

			c			=	((msgLength>>8)&0xFF);
			sendchar(c);
			checksum	^=	c;

			c			=	msgLength&0x00FF;
			sendchar(c);
			checksum ^= c;

			sendchar(TOKEN);
			checksum ^= TOKEN;

			p	=	msgBuffer;
			while ( msgLength )
			{
				c	=	*p++;
				sendchar(c);
				checksum ^=c;
				msgLength--;
			}
			sendchar(checksum);
			seqNum++;

		#ifndef REMOVE_BOOTLOADER_LED
			//*	<MLS>	toggle the LED
			PROGLED_PORT	^=	(1<<PROGLED_PIN);	// active high LED ON
		#endif

		}
	}

#ifdef _DEBUG_WITH_LEDS_
	//*	this is for debugging it can be removed
	for (ii=0; ii<10; ii++)
	{
		PROGLED_PORT	&=	~(1<<PROGLED_PIN);	// turn LED off
		delay_ms(200);
		PROGLED_PORT	|=	(1<<PROGLED_PIN);	// turn LED on
		delay_ms(200);
	}
	PROGLED_PORT	&=	~(1<<PROGLED_PIN);	// turn LED off
#endif

#ifdef _DEBUG_SERIAL_
	sendchar('j');
//	sendchar('u');
//	sendchar('m');
//	sendchar('p');
//	sendchar(' ');
//	sendchar('u');
//	sendchar('s');
//	sendchar('r');
	sendchar(0x0d);
	sendchar(0x0a);

	delay_ms(100);
#endif


#ifndef REMOVE_BOOTLOADER_LED
	PROGLED_DDR	&=	~(1<<PROGLED_PIN);	// set to default
	PROGLED_PORT	&=	~(1<<PROGLED_PIN);	// active low LED OFF
	delay_ms(100);					// delay after exit
#endif

#ifdef BOOT_PIN_EN
	STATUSLED_PORT	|=	(1<<STATUSLED_PIN);	// active low LED OFF
#endif

	asm volatile ("nop");			// wait until port has changed

	/*
	 * Now leave bootloader
	 */

    start_user ();

//	asm volatile ( "push r1" "\n\t"		// Jump to Reset vector in Application Section
//					"push r1" "\n\t"
//					"ret"	 "\n\t"
//					::);

	 /*
	 * Never return to stop GCC to generate exit return code
	 * Actually we will never reach this point, but the compiler doesn't
	 * understand this
	 */
	for(;;);
}

//************************************************************************
#ifdef ENABLE_MONITOR
#include	<math.h>

unsigned long	gRamIndex;
unsigned long	gFlashIndex;
unsigned long	gEepromIndex;


#define	true	1
#define	false	0

#include	"avr_cpunames.h"

#ifndef _AVR_CPU_NAME_
	#error cpu name not defined
#endif

#ifdef _VECTORS_SIZE
	#define	kInterruptVectorCount (_VECTORS_SIZE / 4)
#else
	#define	kInterruptVectorCount 23
#endif


void	PrintDecInt(int theNumber, int digitCnt);

#ifdef _AVR_CPU_NAME_
	const char	gTextMsg_CPU_Name[]			PROGMEM	=	_AVR_CPU_NAME_;
#else
	const char	gTextMsg_CPU_Name[]			PROGMEM	=	"UNKNOWN";
#endif

	const char	gTextMsg_Explorer[]			PROGMEM	=	"Arduino explorer stk500V2 by MLS";
	const char	gTextMsg_Prompt[]			PROGMEM	=	"Bootloader>";
	const char	gTextMsg_HUH[]				PROGMEM	=	"Huh?";
	const char	gTextMsg_COMPILED_ON[]		PROGMEM	=	"Compiled on = ";
	const char	gTextMsg_CPU_Type[]			PROGMEM	=	"CPU Type    = ";
	const char	gTextMsg_AVR_ARCH[]			PROGMEM	=	"__AVR_ARCH__= ";
	const char	gTextMsg_AVR_LIBC[]			PROGMEM	=	"AVR LibC Ver= ";
	const char	gTextMsg_GCC_VERSION[]		PROGMEM	=	"GCC Version = ";
	const char	gTextMsg_CPU_SIGNATURE[]	PROGMEM	=	"CPU ID      = ";
	const char	gTextMsg_FUSE_BYTE_LOW[]	PROGMEM	=	"Low fuse    = ";
	const char	gTextMsg_FUSE_BYTE_HIGH[]	PROGMEM	=	"High fuse   = ";
	const char	gTextMsg_FUSE_BYTE_EXT[]	PROGMEM	=	"Ext fuse    = ";
	const char	gTextMsg_FUSE_BYTE_LOCK[]	PROGMEM	=	"Lock fuse   = ";
	const char	gTextMsg_GCC_DATE_STR[]		PROGMEM	=	__DATE__;
	const char	gTextMsg_AVR_LIBC_VER_STR[]	PROGMEM	=	__AVR_LIBC_VERSION_STRING__;
	const char	gTextMsg_GCC_VERSION_STR[]	PROGMEM	=	__VERSION__;
	const char	gTextMsg_VECTOR_HEADER[]	PROGMEM	=	"V#   ADDR   op code     instruction addr   Interrupt";
	const char	gTextMsg_noVector[]			PROGMEM	=	"no vector";
	const char	gTextMsg_rjmp[]				PROGMEM	=	"rjmp  ";
	const char	gTextMsg_jmp[]				PROGMEM	=	"jmp ";
	const char	gTextMsg_WHAT_PORT[]		PROGMEM	=	"What port:";
	const char	gTextMsg_PortNotSupported[]	PROGMEM	=	"Port not supported";
	const char	gTextMsg_MustBeLetter[]		PROGMEM	=	"Must be a letter";
	const char	gTextMsg_SPACE[]			PROGMEM	=	" ";
	const char	gTextMsg_WriteToEEprom[]	PROGMEM	=	"Writting EE";
	const char	gTextMsg_ReadingEEprom[]	PROGMEM	=	"Reading EE";
	const char	gTextMsg_EEPROMerrorCnt[]	PROGMEM	=	"EE err cnt=";
	const char	gTextMsg_PORT[]				PROGMEM	=	"PORT";


//************************************************************************
//*	Help messages
	const char	gTextMsg_HELP_MSG_0[]		PROGMEM	=	"0=Zero addr";
	const char	gTextMsg_HELP_MSG_QM[]		PROGMEM	=	"?=CPU stats";
	const char	gTextMsg_HELP_MSG_AT[]		PROGMEM	=	"@=EEPROM test";
	const char	gTextMsg_HELP_MSG_B[]		PROGMEM	=	"B=Blink LED";
	const char	gTextMsg_HELP_MSG_E[]		PROGMEM	=	"E=Dump EEPROM";
	const char	gTextMsg_HELP_MSG_F[]		PROGMEM	=	"F=Dump FLASH";
	const char	gTextMsg_HELP_MSG_H[]		PROGMEM	=	"H=Help";
	const char	gTextMsg_HELP_MSG_L[]		PROGMEM	=	"L=List I/O Ports";
//	const char	gTextMsg_HELP_MSG_Q[]		PROGMEM	=	"Q=Quit & jump to user pgm";
	const char	gTextMsg_HELP_MSG_Q[]		PROGMEM	=	"Q=Quit";
	const char	gTextMsg_HELP_MSG_R[]		PROGMEM	=	"R=Dump RAM";
	const char	gTextMsg_HELP_MSG_V[]		PROGMEM	=	"V=show interrupt Vectors";
	const char	gTextMsg_HELP_MSG_Y[]		PROGMEM	=	"Y=Port blink";

	const char	gTextMsg_END[]				PROGMEM	=	"*";


//************************************************************************
void	PrintFromPROGMEM(const void *dataPtr, unsigned char offset)
{
char	theChar;

	dataPtr		+=	offset;

	do {
	#if (FLASHEND > 0x10000)
		theChar	=	pgm_read_byte_far((uint16_t)dataPtr++);
	#else
		theChar	=	pgm_read_byte_near((uint16_t)dataPtr++);
	#endif
		if (theChar != 0)
		{
			sendchar(theChar);
		}
	} while (theChar != 0);
}

//************************************************************************
void	PrintNewLine(void)
{
	sendchar(0x0d);
	sendchar(0x0a);
}


//************************************************************************
void	PrintFromPROGMEMln(const void *dataPtr, unsigned char offset)
{
	PrintFromPROGMEM(dataPtr, offset);

